app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Science"], ["room_number", 100]]
---
    def create
    @school_class = SchoolClass.create(schoolclass_params)