app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Mike"], ["last_name", "Rakitzis1"], ["updated_at", "2020-11-27 19:55:20.651494"], ["id", 1]]
---
    def update
        @student = Student.find_by(id:params[:id])
        @student = Student.update(student_params)